% [b,a] = butter(n,Wn) 设计一个阶为n
% 归一化截止频率为Wn的数字低通巴特沃斯滤波器。
% 计算N阶s域巴特沃斯数字滤波器系统函数分子、分母多项式的系数向量b、a。
[B,A]=butter(3,2*pi*1000,'s'); %参数's'去除归一化频率限制,2*pi*1000为3dB边界频率
[num1,den1]=impinvar(B,A,4000); %(采样频率fs =4kHz）进行脉冲响应不变法线性变换
%返回z域的的系数 num1为分子上的系数 den1位分母上的系数,或者理解为差分方程x和y的系数
[h1,w]=freqz(num1,den1); %求该系统的频率响应 h1为频率响应 ,w1为幅度相应
[B,A]=butter(3,2/0.00025,'s'); %%参数's'去除归一化频率限制
[num2,den2]=bilinear(B,A,4000); %双线性变化法
[h2,w]=freqz(num2,den2); %返回频率响应和数字频率
f=w/pi*2000; %转换到模拟频率
plot(f,abs(h1),'-.',f,abs(h2),'-'); 
grid; 
xlabel('频率/Hz ') 
ylabel('幅值/dB') 
legend('脉冲响应不变法','双线性变化法')