% 设计一数字高通滤波器，它的通带为400～500Hz
% ，通带内容许有0.5dB的波动，阻带内衰减在小于317Hz
% 的频带内至少为19dB，采样频率为1,000Hz
wp=2*1000*tan(2*pi*400/(2*1000)); %通带截止频率
ws=2*1000*tan(2*pi*317/(2*1000)); %祖代截止频率
% [n,Wp] = cheb1ord(Wp,Ws,Rp,Rs)
% 参数分别为通带截止频率,祖代截止频率,通带允许衰减,阻带最小衰减
[N,wn]=cheb1ord(wp,ws,0.5,19,'s'); %(wn = wp),通带边沿频率Wp必须为0.0 <Wp <1.0,%参数's'去除归一化频率限制
% 返回Chebyshev I型滤波器的最低阶n，其通带损耗不超过Rp dB，阻带衰减至少为Rs dB。
%还返回相应的截止频率Wp(wn)的标量（或矢量）。
[B,A]=cheby1(N,0.5,wn,'high','s'); %参数's'去除归一化频率限制
[num,den]=bilinear(B,A,1000); %双线性变化法
[h,w]=freqz(num,den); %返回频率响应和数字频率
f=w/pi*500; %转换到模拟频率
plot(f,20*log10(abs(h))); 
axis([0,500,-80,10]); 
 grid; 
 xlabel('频率/Hz') 
ylabel('幅度/dB') 
